---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarReinforcementData Members
RebarReinforcementData Class Methods Properties See Also Send Feedback
---

The RebarReinforcementData type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarReinforcementData, or nullNothingnullptra null reference (Nothing in Visual Basic) if the operation fails. |
|  | Dispose | (Inherited from ReinforcementData.) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | End | The end of the rebar. The end should be 0 or 1. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ReinforcementData.) |
|  | RebarId | The id of the Rebar |

# See Also

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace